In [2]:
try:
    file=open('data.csv','x')
    file.close()
except:
    print("The file is already there!")

The file is already there!

In [7]:
import pandas as pd
df=pd.read_csv('data.csv',nrows=2)
df

        SN  Name  Age       Add  Phone
0  Rachana    32  KTM  98000000    NaN
1      Ram    30  BKT  98000006    NaN

In [11]:
import pandas as pd
df=pd.read_csv('data.csv')
#df.head(1)
df.tail(1)

   SN  Name  Age  Add    Phone
2   3  Sita   45  GIT  4557890

In [1]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='SN')
#df.head(1)
df.tail(1)

    Name  Age  Add      Phone
SN
5   Gita   25  BIR  987765432

In [17]:
df=pd.read_csv('data.csv',usecols=['SN','Name','Phone'])
df

   SN     Name     Phone
0   1  Rachana  98000000
1   2      Ram  98000006
2   3     Sita   4557890

In [21]:
#iloc
import pandas as pd
df=pd.read_csv('data.csv')
df.iloc[1:5]#row selection

   SN  Name  Age  Add      Phone
1   2   Ram   30  BKT   98000006
2   3  Sita   45  GIT    4557890
3   4  Rita   30  KTM    9800000
4   5  Gita   25  BIR  987765432

In [22]:
#iloc
import pandas as pd
df=pd.read_csv('data.csv')
df.iloc[1:5,0:4]#row and column selection on the basis of index

   SN  Name  Age  Add
1   2   Ram   30  BKT
2   3  Sita   45  GIT
3   4  Rita   30  KTM
4   5  Gita   25  BIR

In [ ]:
#iloc=index localizer
#loc(index_col is mendatory)

In [24]:
df=pd.read_csv('data.csv',index_col='SN')
df.loc[2:5]#on the basis of value

    Name  Age  Add      Phone
SN
2    Ram   30  BKT   98000006
3   Sita   45  GIT    4557890
4   Rita   30  KTM    9800000
5   Gita   25  BIR  987765432

In [26]:
df=pd.read_csv('data.csv',index_col='Name')
df.loc["Rachana":"Sita"]#on the basis of value

         SN  Age  Add     Phone
Name
Rachana   1   32  KTM  98000000
Ram       2   30  BKT  98000006
Sita      3   45  GIT   4557890

In [27]:
#filter
df=pd.read_csv('data.csv')
df['Name']

0    Rachana
1        Ram
2       Sita
3       Rita
4       Gita
Name: Name, dtype: object

In [28]:
df['Name']=='Ram'

0    False
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [29]:
df[df['Name']=='Ram']

   SN Name  Age  Add     Phone
1   2  Ram   30  BKT  98000006

In [35]:
df[df['Add']=='KTM']

   SN     Name  Age  Add     Phone
0   1  Rachana   32  KTM  98000000
3   4     Rita   30  KTM   9800000

In [34]:
df[(df['Age'] >=30) & (df['Add']=='KTM')]

   SN     Name  Age  Add     Phone
0   1  Rachana   32  KTM  98000000
3   4     Rita   30  KTM   9800000

In [24]:
df=pd.read_csv('data.csv',index_col='SN')
df.loc[2:5]#on the basis of value

    Name  Age  Add      Phone
SN
2    Ram   30  BKT   98000006
3   Sita   45  GIT    4557890
4   Rita   30  KTM    9800000
5   Gita   25  BIR  987765432